Repository: Meddd20/menstrual_calender
Catalog: lib/l10n/app_*.arb
Languages: id

# shettlesPredictionMethod17
source: Dr. Shettles claimed that his methodology had an 80% success rate among his patients, but he acknowledged that the method does not guarantee the desired outcome. Blogger Genevieve Howland of Mama Natural reports that the Shettles method helped her conceive a girl with her second pregnancy by timing intercourse three days before ovulation, which resulted in a girl. She also notes that having intercourse on the day of ovulation with her first pregnancy resulted in a boy. However, not all researchers agree with Shettles' claims. A 1991 review of studies found no support for the idea that timing intercourse affects the sex of the baby. This review noted that fewer male babies were conceived during peak ovulation, with more male babies conceived three to four days before or two to three days after ovulation. A 2001 study refuted Shettles' assertion that X- and Y-containing sperm have different shapes, directly contradicting his research. Additionally, a 1995 study indicated that having sex two to three days after ovulation does not necessarily lead to pregnancy. The science remains unclear. Currently, the only guaranteed method to select a baby's sex is through preimplantation genetic diagnosis (PGD), a procedure sometimes used in conjunction with in vitro fertilization (IVF). A 2016 study indicates that there is no evidence to support the idea that the timing or pattern of intercourse influences the sex of the fetus. Similarly, a 2020 study found that there are no significant differences between male and female sperm that would impact their behavior in a way that supports the Shettles method.
id: Dr. Shettles mengklaim bahwa metodologinya memiliki tingkat keberhasilan 80% di antara pasien-pasiennya, tetapi ia mengakui bahwa metode ini tidak menjamin hasil yang diinginkan. Blogger Genevieve Howland dari Mama Natural melaporkan bahwa metode Shettles membantunya mengandung seorang perempuan pada kehamilan keduanya dengan melakukan hubungan seksual tiga hari sebelum ovulasi, yang menghasilkan seorang perempuan. Dia juga mencatat bahwa melakukan hubungan seksual pada hari ovulasi dengan kehamilan pertamanya menghasilkan seorang laki-laki. Namun, tidak semua peneliti setuju dengan klaim Shettles. Tinjauan studi 1991 tidak menemukan dukungan untuk gagasan bahwa waktu hubungan seksual memengaruhi jenis kelamin bayi. Tinjauan ini mencatat bahwa lebih sedikit bayi laki-laki dikandung selama ovulasi puncak, dengan lebih banyak bayi laki-laki dikandung tiga hingga empat hari sebelum atau dua hingga tiga hari setelah ovulasi. Studi 2001 membantah klaim Shettles bahwa sperma yang mengandung X dan Y memiliki bentuk yang berbeda, yang secara langsung bertentangan dengan penelitiannya. Selain itu, studi 1995 menunjukkan bahwa melakukan hubungan seksual dua hingga tiga hari setelah ovulasi tidak selalu menyebabkan kehamilan. Ilmu pengetahuan tetap tidak jelas. Saat ini, satu-satunya metode yang dijamin untuk memilih jenis kelamin bayi adalah melalui diagnosis genetik pre-implantasi (PGD), sebuah prosedur yang kadang-kadang digunakan bersamaan dengan fertilisasi in vitro (IVF). Studi 2016 menunjukkan bahwa tidak ada bukti yang mendukung gagasan bahwa waktu atau pola hubungan seksual memengaruhi jenis kelamin janin. Demikian pula, studi 2020 menemukan bahwa tidak ada perbedaan signifikan antara sperma laki-laki dan perempuan yang akan memengaruhi perilaku mereka dengan cara yang mendukung metode Shettles.

# chineseGenderPredction
source: Chinese Gender Predictions
id: Prediksi Gender Cina

# chineseGenderPredction1
source: Your baby gender is predicted to be..
id: Jenis kelamin bayi Anda diprediksi menjadi..

source: girl
id: perempuan

source: boy
id: laki-laki

source: Mother's Age
id: Usia Ibu

source: Mother's Lunar Age
id: Usia Lunar Ibu

# mothersBirthdayAge
source: Mother's Birthday in Western Date
id: Tanggal Lahir Ibu (Kalender Barat)

# mothersBirthdayLunarAge
source: Mother's Birthday in Lunar Date
id: Tanggal Lahir Ibu (Kalender Lunar)

# babyConceivedDate
source: Baby Conceived in Western Date
id: Tanggal Konsepsi Bayi (Kalender Barat)

# babyConceivedLunarDate
source: Baby Conceived in Lunar Date
id: Tanggal Konsepsi Bayi (Kalender Lunar)

# chineseGenderPredction2
source: What is Chinese Gender Predictor Chart?
id: Apa itu Grafik Prediksi Gender Cina?

# chineseGenderPredction3
source: To use it, you first have to find the mother's lunar age at conception, which is different from her age in the Western calendar. Then, you locate the month of conception on the chart. By intersecting these two points, the chart suggests the baby's gender. However, its accuracy is a matter of debate. Some view its effectiveness as rooted more in cultural belief than empirical evidence. Nevertheless, many expectant parents worldwide still enjoy using it, adding a touch of mystery to the excitement of awaiting their baby's arrival. The widely believed story is that the Chinese Gender Calendar Chart was made during the Qing Dynasty (1644-1911 A.D.). It's said to be inspired by the ancient text "Book of Changes," which talks about the Five Elements (Metal, Water, Wood, Fire, and Earth), Yin and Yang, and the Eight Trigrams. Legend has it that the imperial family of the Qing Dynasty used this chart to choose the gender of their children. It was a closely guarded secret within the palace and wasn't shared with the public. The Chinese Gender Predictor Chart has two popular stories about its origins. One tale claims it was created during the Qing Dynasty and used by the imperial family to choose the gender of their children. It was kept secret until the end of the dynasty when it was taken during the Boxer Rebellion and ended up in England and Austria before being published in Taiwan in 1972. Another story suggests it was found buried in a royal tomb over 700 years ago near Beijing. Despite these interesting stories, there's no scientific proof that the chart works. It's more of a cultural tradition, used for fun rather than as a reliable way to predict a baby's gender. After reviewing over 38,000 delivery records at Massachusetts General Hospital from 1995 to 2008, it was found that the claimed accuracy of the Chinese birth calendar in predicting infant gender (93-99%) is greatly exaggerated. Both the Gregorian and Chinese lunar calendars only accurately predicted gender about 50% of the time, no better accuracy than a coin toss. Similarly, a study led by Dr. Eduardo Villamor from the University of Michigan, examining 2.8 million Swedish births from 1973 to 2006, concluded that the Chinese lunar calendar method is no better than guessing and lacks scientific validity, despite claims of high accuracy on some websites.
id: Untuk menggunakannya, pertama-tama Anda harus menemukan usia lunar ibu saat konsepsi, yang berbeda dari usia ibu dalam kalender Barat. Kemudian, Anda menemukan bulan konsepsi pada grafik. Dengan menghubungkan kedua titik ini, grafik akan menunjukkan jenis kelamin bayi. Namun, akurasinya masih diperdebatkan. Beberapa orang menganggap efektivitasnya lebih sebagai kepercayaan budaya daripada bukti empiris. Meskipun begitu, banyak calon orang tua di seluruh dunia masih menikmati penggunaannya, menambahkan sentuhan misteri pada kegembiraan menanti kedatangan bayi mereka. Kisah yang diyakini luas adalah bahwa Grafik Prediksi Gender Cina dibuat selama Dinasti Qing (1644-1911 M). Dikatakan terinspirasi oleh teks kuno "Buku Perubahan," yang membahas Lima Elemen (Logam, Air, Kayu, Api, dan Tanah), Yin dan Yang, serta Delapan Trigram. Legenda mengatakan bahwa keluarga kekaisaran Dinasti Qing menggunakan grafik ini untuk memilih jenis kelamin anak-anak mereka. Grafik ini adalah rahasia yang sangat dijaga di dalam istana dan tidak dibagikan kepada publik. Grafik Prediksi Gender Cina memiliki dua cerita populer tentang asal-usulnya. Salah satu cerita mengatakan bahwa grafik ini dibuat selama Dinasti Qing dan digunakan oleh keluarga kekaisaran untuk memilih jenis kelamin anak-anak mereka. Grafik ini dirahasiakan hingga akhir dinasti ketika diambil selama Pemberontakan Boxer dan akhirnya sampai di Inggris dan Austria sebelum diterbitkan di Taiwan pada tahun 1972. Cerita lain menyebutkan bahwa grafik ini ditemukan terkubur di makam kerajaan lebih dari 700 tahun yang lalu dekat Beijing. Meskipun cerita-cerita menarik ini, tidak ada bukti ilmiah yang mendukung bahwa grafik ini berfungsi. Grafik ini lebih merupakan tradisi budaya, digunakan untuk bersenang-senang daripada sebagai cara yang dapat diandalkan untuk memprediksi jenis kelamin bayi. Setelah meninjau lebih dari 38.000 catatan kelahiran di Massachusetts General Hospital dari 1995 hingga 2008, ditemukan bahwa klaim akurasi kalender kelahiran Cina dalam memprediksi jenis kelamin bayi (93-99%) sangat dibesar-besarkan. Baik kalender Gregorian maupun kalender lunar Cina hanya memprediksi jenis kelamin dengan akurasi sekitar 50% dari waktu, tidak lebih baik daripada lemparan koin. Demikian juga, sebuah studi yang dipimpin oleh Dr. Eduardo Villamor dari Universitas Michigan, yang memeriksa 2,8 juta kelahiran di Swedia dari 1973 hingga 2006, menyimpulkan bahwa metode kalender lunar Cina tidak lebih baik dari sekadar menebak dan kurang valid secara ilmiah, meskipun ada klaim akurasi tinggi di beberapa situs web.

source: Didn't have sex
id: Tidak berhubungan seks

source: Unprotected sex
id: Seks tanpa perlindungan

source: Protected sex
id: Seks dengan perlindungan

source: No discharge
id: Tidak ada keputihan

# creamyDischarge
source: Creamy
id: Kental

# spottingDischarge
source: Spotting
id: Bercak

# eggwhiteDischarge
source: Eggwhite
id: Putih telur

# stickyDischarge
source: Sticky
id: Lengket

# wateryDischarge
source: Watery
id: Cair

# unusualDischarge
source: Unusual
id: Tidak biasa

source: Abdominal cramps
id: Kram perut

source: Acne
id: Jerawat

source: Backache
id: Nyeri punggung

source: Bloating
id: Kembung

source: Body aches
id: Nyeri tubuh

source: Chills
id: Menggigil

source: Constipation
id: Susah Buang Air Besar

source: Cramps
id: Kram

source: Cravings
id: Keinginan makan

source: Diarrhea
id: Diare

source: Dizziness
id: Pusing

source: Fatigue
id: Kelelahan

source: Feel good
id: Merasa baik

source: Headache
id: Sakit Kepala

source: Low back pain
id: Nyeri punggung bawah

source: Nausea
id: Mual

source: Nipple changes
id: Perubahan puting susu

source: Spotting
id: Bercak

source: Swelling
id: Pembengkakan

source: Tender breasts
id: Payudara nyeri

source: Angry
id: Marah

source: Anxious
id: Cemas

source: Apathetic
id: Apatis

source: Calm
id: Tenang

source: Confused
id: Bingung

source: Cranky
id: Murung

source: Depressed
id: Depresi

source: Emotional
id: Emosional

source: Energetic
id: Enerjik

source: Excited
id: Bersemangat

source: Feeling guilty
id: Merasa bersalah

source: Frisky
id: Bersemangat

source: Frustrated
id: Frustrasi

source: Happy
id: Bahagia

source: Irritated
id: Terasa terganggu

source: Low energy
id: Energi rendah

source: Mood swings
id: Perubahan suasana hati

source: Obsessive thoughts
id: Pikiran obsesif

source: Sad
id: Sedih

source: Sensitive
id: Sensitif

source: Sleepy
id: Ngantuk

source: Tired
id: Lelah

source: Unfocused
id: Tidak fokus

source: Very self-critical
id: Sangat kritis terhadap diri sendiri

source: Travel
id: Perjalanan

source: Stress
id: Stres

source: Disease or Injury
id: Penyakit atau cedera

source: Alcohol
id: Alkohol

source: Didn't exercise
id: Tidak berolahraga

# aerobicsAndDancing
source: Aerobics & Dancing
id: Aerobik & Menari

source: Swimming
id: Berenang

source: Team sports
id: Olahraga tim

source: Running
id: Berlari

source: Cycling
id: Bersepeda

source: Walking
id: Berjalan

source: Basal Temperature
id: Suhu Basal

source: Save Temperature
id: Simpan Suhu

source: My Weight
id: Berat Badan Saya

source: Save Weight
id: Simpan Berat Badan

source: Daily Notes
id: Catatan Harian

source: Save notes
id: Simpan Catatan

source: Add Daily Log
id: Tambahkan Catatan Harian

source: Add New Reminder
id: Tambah Pengingat Baru

# adjustDates
source: Adjust the start and end dates for precise and up-to-date reminder information.
id: Sesuaikan tanggal mulai dan akhir untuk informasi pengingat yang tepat dan terkini.

source: Time
id: Waktu

source: Select Time
id: Pilih Waktu

source: Enter reminder title
id: Masukkan judul pengingat

source: Enter reminder description
id: Masukkan deskripsi pengingat

source: Add Reminder
id: Tambah Pengingat

source: Permission Required
id: Izin Diperlukan

# notificationPermissionRequired
source: Notification permission is required to use this feature. Please enable it in the app settings.
id: Izin notifikasi diperlukan untuk menggunakan fitur ini. Harap aktifkan di pengaturan aplikasi.

source: Open Settings
id: Buka Pengaturan

source: Permission Denied
id: Izin Ditolak

# allowNotifications
source: Please allow the app to send notifications to use this feature.
id: Harap izinkan aplikasi untuk mengirim notifikasi untuk menggunakan fitur ini.

# customAlerts
source: Set custom alerts for your pregnancy milestones and appointments, so you never miss an important event.
id: Atur peringatan khusus untuk tonggak kehamilan dan janji Anda, sehingga Anda tidak pernah melewatkan acara penting.

source: Edit Reminder
id: Edit Pengingat

source: Update Reminder
id: Perbarui Pengingat

source: Today
id: Hari ini

source: Tomorrow
id: Besok

source: Pregnancy Mode
id: Mode Kehamilan

# weeksPregnant
source: {weeks} Weeks Pregnant
id: {weeks} Minggu Hamil

source: Due date
id: Tanggal Perkiraan

# weekDue
source: Weeks left
id: Sisa Minggu Kehamilan

source: Trimester
id: Trimester Minggu Ini

# babySize
source: Baby is as big as
id: Ukuran bayi seperti

source: Ideal weight
id: Berat ideal

source: Ideal height
id: Tinggi ideal

source: This Week's Highlight
id: Sorotan Minggu Ini

source: Body Changes This Week
id: Perubahan Tubuh Minggu Ini

source: Your Baby This Week
id: Bayi Anda Minggu Ini

source: Symptoms You Might Feel
id: Gejala Yang Mungkin Anda Rasakan

source: Things to Consider
id: Hal-Hal yang Perlu Dipertimbangkan

source: Menstruation Mode
id: Mode Menstruasi

source: Year
id: Tahun

source: Month
id: Bulan

source: Current cycle
id: Siklus saat ini

source: day of the cycle
id: hari dalam siklus

# pregnancyChances
source: {pregnancyChance} chances of getting pregnant
id: {pregnancyChance} peluang untuk hamil

# daysLeft
source: {daysLeft} Days Left
id: {daysLeft} Hari Tersisa

source: Period
id: Menstruasi

source: Fertile days
id: Hari subur

source: Safe days
id: Hari aman

source: Manage Your Period Events
id: Kelola Peristiwa Menstruasi Anda

# trackYourPeriodCycle
source: Set reminders for every important activity.
id: Lacak siklus menstruasi dan peristiwa terkait lainnya

source: Remark your body changes
id: Catat perubahan tubuh Anda

# logYourBodyChanges
source: Log your body changes in every cycle
id: Catat perubahan tubuh Anda di setiap siklus

source: Daily Log
id: Log Harian

source: Chinese gender calendar
id: Kalender jenis kelamin Cina

source: Did you know?
id: Tahukah Anda?

# accordingTo
source: According to the
id: Menurut

source: ancient Chinese gender chart
id: bagan jenis kelamin Cina kuno

# genderPrediction
source: , if you were to conceive today, based on your age and the month of the current month of the conception, it predicts the gender of your future child as
id: , jika Anda hamil hari ini, berdasarkan usia Anda dan bulan konsepsi saat ini, diprediksi jenis kelamin anak Anda adalah

source: Learn more
id: Pelajari lebih lanjut

source: The Shettles Method
id: Metode Shettles

source: Increase Gender Prediction Probability
id: Tingkatkan Kemungkinan Prediksi Jenis Kelamin

# aimForIntercourse
source: Aim for intercourse on ovulation day and the next 2-3 days
id: Berhubunganlah pada hari ovulasi dan 2-3 hari berikutnya

# likelyConceiveMale
source: from {boyStartDate} until {boyEndDate} to likely conceive a male
id: dari {boyStartDate} hingga {boyEndDate} untuk kemungkinan besar mengandung anak laki-laki

# likelyConceiveFemale
source: , and have intercourse from the end of menstruation until three days before ovulation, avoiding sex 2-3 days before ovulation
id: , dan berhubungan dari akhir menstruasi hingga tiga hari sebelum ovulasi, hindari berhubungan 2-3 hari sebelum ovulasi

# femalePrediction
source: from {girlStartDate} until {girlEndDate} to likely conceive a female.
id: dari {girlStartDate} hingga {girlEndDate} untuk kemungkinan besar mengandung anak perempuan.

source: Menstruation Phase
id: Masa Menstruasi

source: Fertile Phase
id: Masa Subur

source: Follicular Phase
id: Fase Folikuler

source: Luteal Phase
id: Fase Luteal

source: Low
id: Rendah

source: High
id: Tinggi

# notFound
source: Result Not Found
id: Hasil Tidak Ditemukan

# notFoundDesc
source: Oops... it looks like there's no information available yet.
id: Ups... sepertinya belum ada informasi yang tersedia.

source: Home
id: Beranda

source: Analysis
id: Analisis

source: Tools
id: Alat

source: Insight
id: Wawasan

source: Profile
id: Profil

source: Username
id: Nama Pengguna

# email
source: Email Address
id: Alamat Email

source: Password
id: Kata Sandi

source: Confirm Password
id: Konfirmasi Kata Sandi

# days
source: {day} Days
id: {day} Hari

source: Next
id: Lanjut

# aboutAppInfo
source: This Menstrual and Pregnancy Calendar application was developed by Medhiko Biraja as part of a final project for the Information Technology program at the Faculty of Engineering, Udayana University.
id: Aplikasi Kalender Menstruasi dan Kehamilan ini dikembangkan oleh Medhiko Biraja sebagai bagian dari proyek tugas akhir dalam program studi Teknologi Informasi, Fakultas Teknik, Universitas Udayana.

# creditToFlaticon
source: The icons used in this application were sourced from Flaticon. The icons can be found at www.flaticon.com.
id: Ikon-ikon yang digunakan dalam aplikasi ini diambil dari Flaticon. Ikon-ikon ini dapat ditemukan di www.flaticon.com.

# creditToBabyCenter
source: The baby size comparison images used in this application were sourced from BabyCenter. The images can be found at www.babycenter.com.
id: Gambar perbandingan ukuran bayi yang digunakan dalam aplikasi ini diambil dari BabyCenter. Gambar-gambar ini dapat ditemukan di www.babycenter.com.

# creditToWhatToExpect
source: The fetal images used for each week of pregnancy in this application were sourced from What to Expect. The images can be found at www.whattoexpect.com/pregnancy/week-by-week/.
id: Gambar janin yang digunakan untuk setiap minggu kehamilan dalam aplikasi ini diambil dari situs What to Expect. Gambar-gambar ini dapat ditemukan di www.whattoexpect.com/pregnancy/week-by-week/.

# securePinHeader
source: Secure Your App with a PIN
id: Amankan Aplikasi Anda dengan PIN

# securePinDescription
source: Protect your personal data and ensure that only you can access the app.
id: Jaga privasi data pribadi Anda dan pastikan hanya Anda yang dapat mengakses aplikasi.

# setPinCode
source: Set Your PIN
id: Atur PIN Anda

# setPinCodeDescription
source: Enter your PIN code below
id: Masukkan PIN Anda di bawah ini

# confirmPinCode
source: Confirm Your PIN code
id: Konfirmasi PIN Anda

# confirmPinCodeDescription
source: Enter your PIN code again
id: Masukkan PIN Anda sekali lagi

# enterPin
source: Enter your PIN code
id: Masukkan PIN Anda

# enterPinDesc
source: Enter your PIN code to continue
id: Masukkan PIN Anda untuk melanjutkan

# errorPinCode
source: Your PIN don't match. Please try again!
id: PIN Anda tidak cocok. Silakan coba lagi!

source: Pregnancy Log
id: Catatan Kehamilan

source: Contraction Timer
id: Timer Kontraksi

source: Blood Pressure
id: Tekanan Darah

source: Baby Kicks
id: Gerakan Bayi

source: Logs
id: Log

source: Back to current date
id: Kembali ke tanggal saat ini

source: Pregnancy Symptoms
id: Gejala Kehamilan

source: Duration
id: Durasi

source: First Kick
id: Gerakan Pertama

source: Last Kick
id: Gerakan Terakhir

source: Kicks Count
id: Jumlah Gerakan

source: Kick Count
id: Hitungan Gerakan

source: No kicks recorded yet
id: Belum ada gerakan

source: Add Blood Pressure
id: Tambah Tekanan Darah

source: Systolic
id: Sistolik

source: Diastolic
id: Diastolik

source: Pulse
id: Nadi

source: Pressure
id: Tekanan

source: Edit Blood Pressure
id: Edit Tekanan Darah

source: Delete Blood Pressure
id: Hapus Tekanan Darah

# periodAddedSuccess
source: Period added successfully!
id: Menstruasi berhasil ditambahkan!

# periodAddFailed
source: Failed to add period. Please try again!
id: Gagal menambahkan menstruasi. Silakan coba lagi!

# selectPeriodStartDate
source: Please select your period start date!
id: Silakan pilih tanggal mulai menstruasi Anda!

# periodEditedSuccess
source: Period edited successfully!
id: Menstruasi berhasil diedit!

# periodEditFailed
source: Failed to edit period. Please try again!
id: Gagal mengedit menstruasi. Silakan coba lagi!

# dailyLogSavedSuccess
source: Daily log saved successfully!
id: Catatan harian berhasil disimpan!

# dailyLogSaveFailed
source: Failed to save log. Please try again!
id: Gagal menyimpan catatan. Silakan coba lagi!

# firstDayOfLastPeriodEditedSuccess
source: First day of your last period edited successfully!
id: Hari pertama menstruasi terakhir Anda berhasil diedit!

# firstDayOfLastPeriodEditFailed
source: Failed to edit first day of your last period. Please try again!
id: Gagal mengedit hari pertama menstruasi terakhir Anda. Silakan coba lagi!

# reminderAddedSuccess
source: Reminder added successfully!
id: Pengingat berhasil ditambahkan!

# reminderAddFailed
source: Failed to add reminder. Please try again later!
id: Gagal menambahkan pengingat. Silakan coba lagi nanti!

# reminderEditedSuccess
source: Reminder edited successfully!
id: Pengingat berhasil diedit!

# reminderEditFailed
source: Failed to edit reminder. Please try again later!
id: Gagal mengedit pengingat. Silakan coba lagi nanti!

# reminderDeletedSuccess
source: Reminder deleted successfully!
id: Pengingat berhasil dihapus!

# reminderDeleteFailed
source: Failed to delete reminder. Please try again later!
id: Gagal menghapus pengingat. Silakan coba lagi nanti!

# babyKickAddFailed
source: Failed to add baby kick. Please try again later!
id: Gagal menambahkan tendangan bayi. Silakan coba lagi nanti!

# kickDataDeletedSuccess
source: Kick data deleted successfully!
id: Data tendangan berhasil dihapus!

# kickDataDeleteFailed
source: Failed to delete kick data. Please try again later!
id: Gagal menghapus data tendangan. Silakan coba lagi nanti!

# bloodPressureAddedSuccess
source: Blood pressure added successfully!
id: Tekanan darah berhasil ditambahkan!

# bloodPressureAddFailed
source: Failed to add blood pressure. Please try again later!
id: Gagal menambahkan tekanan darah. Silakan coba lagi nanti!

# bloodPressureEditedSuccess
source: Blood pressure edited successfully!
id: Tekanan darah berhasil diedit!

# bloodPressureEditFailed
source: Failed to edit blood pressure. Please try again later!
id: Gagal mengedit tekanan darah. Silakan coba lagi nanti!

# bloodPressureDeletedSuccess
source: Blood pressure deleted successfully!
id: Tekanan darah berhasil dihapus!

# bloodPressureDeleteFailed
source: Failed to delete blood pressure. Please try again later!
id: Gagal menghapus tekanan darah. Silakan coba lagi nanti!

# contractionAddFailed
source: Failed to add contraction. Please try again later!
id: Gagal menambahkan kontraksi. Silakan coba lagi nanti!

# contractionDeleteFailed
source: Failed to delete contraction. Please try again later!
id: Gagal menghapus kontraksi. Silakan coba lagi nanti!

# pregnancyLogSavedSuccess
source: Pregnancy log saved successfully!
id: Catatan kehamilan berhasil disimpan!
