Repository: Meddd20/menstrual_calender
Catalog: lib/l10n/app_*.arb
Languages: id

# welcomeMsg
source: Welcome to Menstrual and Pregnancy Calendar!
id: Selamat Datang di Kalender Menstruasi dan Kehamilan!

# welcomeMsgDesc
source: Easily track your menstrual cycle and pregnancy journey. Receive personalized insights and reminders to support your unique experience.
id: Lacak siklus menstruasi dan perjalanan kehamilan Anda dengan mudah. Dapatkan wawasan dan pengingat yang disesuaikan untuk mendukung pengalaman Anda.

# haveAccount
source: Have an account?
id: Sudah punya akun?

source: Get Started
id: Mulai

# askBirthday
source: When's your birthday?
id: Kapan Tanggal Lahir Anda?

# askBirthdayDesc
source: Providing your birthday helps us offer you a more personalized experience.
id: Memberikan tanggal lahir Anda membantu kami memberikan pengalaman yang lebih personal.

# askGoal
source: What's your app usage goal?
id: Sesuaikan tujuan penggunaan aplikasi Anda

# askGoalDesc
source: Pick the goal that best fits you. All features are available for you to explore!
id: Pilih tujuan yang paling sesuai untuk Anda. Semua fitur tersedia untuk Anda jelajahi!

# trackPeriodGoal
source: Tracking my period
id: Melacak siklus menstruasi

# pregnancyGoal
source: Follow my pregnancy
id: Melacak kehamilan

# askMenstrualCycle
source: How Long is Your Average Menstrual Cycle?
id: Berapa Lama Siklus Menstruasi Anda?

# askMenstrualCycleDesc
source: We'll use this to help predict your next period based on your last one.
id: Kami akan menggunakan informasi ini untuk membantu memprediksi periode menstruasi Anda berikutnya.

# askPeriodLast
source: How Long Does Your Period Usually Last?
id: Berapa Lama Biasanya Menstruasi Anda?

# askPeriodLastDesc
source: Knowing this helps us predict your next period more accurately.
id: Informasi ini membantu kami memprediksi periode menstruasi Anda dengan lebih akurat.

# askPreviousPeriodCycle
source: Enter Your Previous Period Dates
id: Masukkan Tanggal Menstruasi Sebelumnya

# askPreviousPeriodCycleDesc
source: Choose the start date or range of your previous period(s) to help us predict your next cycle accurately.
id: Pilih tanggal mulai atau rentang menstruasi sebelumnya untuk membantu kami memprediksi siklus Anda berikutnya dengan lebih tepat.

# askFirstDayLastPeriod
source: Enter the First Day of Your Last Period
id: Masukkan Hari Pertama Menstruasi Terakhir Anda

# askFirstDayLastPeriodDesc
source: Help us calculate your pregnancy week by entering the first day of your last period.
id: Bantu kami menghitung usia kehamilan Anda dengan memasukkan hari pertama menstruasi terakhir Anda.

# askRegisterAccount
source: Register to save your data or log in to access your account
id: Daftar untuk menyimpan data Anda atau masuk untuk mengakses akun Anda

# askRegisterAccountDesc
source: Register to save your data or log in to your existing account to access your data
id: Daftar untuk menyimpan data Anda atau masuk ke akun Anda yang sudah ada untuk mengakses data Anda

# registerLater
source: I'll Register Later
id: Daftar Nanti

source: Register Now
id: Daftar Sekarang

# registerHeader
source: Create Account
id: Buat Akun

# registerDesc
source: Register to securely store your data
id: Daftar untuk menyimpan data Anda dengan aman

source: Register
id: Daftar

source: Or
id: Atau

source: Login Now
id: Masuk Sekarang

# verificationHeader
source: Verification Code
id: Kode Verifikasi

# verificationDesc
source: Please enter verification code send to
id: Masukkan kode verifikasi yang telah dikirim ke

source: Send Code
id: Kirim Kode

# codeNotReceived
source: Didn’t receive any code?
id: Belum menerima kode?

source: Resend OTP
id: Kirim Ulang OTP

# loginHeader
source: Welcome Back!
id: Selamat Datang Kembali!

# loginDesc
source: Glad to see you again!
id: Senang melihat Anda lagi!

source: Forgot Password?
id: Lupa Kata Sandi?

source: Login
id: Masuk

# didntHaveAccount
source: Didn't have an account?
id: Belum punya akun?

# forgetPasswordHeader
source: Forgot your password?
id: Lupa Kata Sandi?

# forgetPasswordDesc
source: Don’t worry! It happens. Please enter the email associated with your account.
id: Tidak perlu khawatir! Masukkan email yang terkait dengan akun Anda.

# changePasswordHeader
source: Enter Your New Password
id: Masukkan Kata Sandi Baru Anda

# changePasswordDesc
source: Please enter your new password. Make it secure and easy to remember.
id: Buat kata sandi baru yang aman dan mudah diingat.

source: New Password
id: Kata Sandi Baru

# passwordConfirmation
source: Confirmation New Password
id: Konfirmasi Kata Sandi Baru

# confirmNewPassword
source: Confirm your new password
id: Konfirmasi Kata Sandi Baru

# premenstrualSyndrome
source: Premenstrual Syndrome (PMS)
id: Sindrom Pramenstruasi (PMS)

source: Pregnancy
id: Kehamilan

source: Ovulation
id: Masa Ovulasi

source: Menstruation
id: Menstruasi

source: Trying to conceive
id: Mencoba Hamil

source: Fertility
id: Kesuburan

source: Sex
id: Seks

source: Birth Control
id: Kontrasepsi

source: References
id: Referensi

# comments
source: Comments {totalComments}
id: Komentar {totalComments}

source: Delete comment
id: Hapus komentar

source: Reply
id: Balas

# replyToComment
source: Replying to {username}'s comment
id: Balasan untuk komentar {username}

source: Leave your thoughts...
id: Berikan pendapat Anda...

source: Hide replies
id: Sembunyikan balasan

# viewReplies
source: View {totalReplies} replies
id: Lihat {totalReplies} balasan

# periodAnalysis
source: Perod Analysis
id: Analisis Menstruasi

source: My Cycle
id: Siklus Saya

source: See more
id: Lihat Selengkapnya

# periodCycleLogged
source: {totalPeriodCycle} cycle history logged
id: {totalPeriodCycle} catatan siklus telah disimpan

source: Average Cycle Length
id: Rata-Rata Panjang Siklus

source: Average Period Length
id: Rata-Rata Durasi Menstruasi

# daysPrefix
source: days
id: hari

source: Bleeding Flow
id: Aliran Darah

source: Sex Activity
id: Aktivitas Seksual

source: Symptoms
id: Gejala

source: Vaginal Discharge
id: Keputihan

source: Moods
id: Suasana Hati

source: Others
id: Lainnya

source: Physical Activity
id: Aktivitas Fisik

source: Temperature
id: Suhu

source: Weight
id: Berat

source: Reminder
id: Pengingat

source: Notes
id: Catatan

source: from the first day of pregnancy
id: dari hari pertama kehamilan

source: Total Entries
id: Total Entri

# totalEntriesData
source: {totalEntries} Entries
id: {totalEntries} Entri

# entriesFromDate
source: from {dateFromNow} up to today
id: dari {dateFromNow} hingga hari ini

# date
source: Date: {dataDate}
id: Tanggal: {dataDate}

# temperatureCelcius
source: Temperature: {temperature} °C
id: Suhu: {temperature} °C

# weightKilogram
source: Weight: {weight} Kg
id: Berat: {weight} Kg

source: Period Cycle
id: Siklus Menstruasi

source: Period Duration
id: Durasi Menstruasi

source: Add Period Cycle
id: Tambah Siklus Menstruasi

source: Add Period
id: Tambah Menstruasi

# durationValue
source: Duration:
id: Durasi:

# actualPeriod
source: Actual Periods
id: Menstruasi Aktual

# predictionPeriod
source: Prediction Periods
id: Perkiraan Menstruasi

source: Edit Period Cycle
id: Edit Siklus Menstruasi

source: Edit Period
id: Edit Menstruasi

source: Account Activity Detected
id: Aktivitas Akun Terdeteksi

# accountActivityDetectedDesc
source: We detected a login on another device. Please sign in again to secure your account.
id: Kami mendeteksi login di perangkat lain. Silakan masuk lagi untuk mengamankan akun Anda.

source: Logout
id: Keluar

# loginFailed
source: Login Failed: An error occurred on the server. Please try again.
id: Login Gagal: Terjadi kesalahan pada server. Silakan coba lagi.

source: Create New Account
id: Buat Akun Baru

source: Login To Existing Account
id: Masuk ke Akun yang Ada

# overwriteAccountData
source: Overwrite your existing account data?
id: Ganti data akun Anda yang ada?

# overwriteAccountDataConfirm
source: Overwriting your data means your existing account data will be overwritten
id: Mengganti data Anda berarti data akun yang ada akan ditimpa

source: Keep Data
id: Jaga data

source: Overwrite
id: Ganti

# continues
source: Continue
id: Lanjutkan

source: Usage Preference
id: Preferensi Penggunaan

# changeGoalConfirm
source: Are you sure you want to change your goal?
id: Apakah Anda yakin ingin mengubah tujuan Anda?

source: No
id: Tidak

source: Yes
id: Ya

# secureAccess
source: Secure Access (PIN)
id: Akses Aman (PIN)

source: Change Language
id: Ganti Bahasa

source: Language
id: Bahasa

source: Backup Data Preferences
id: Preferensi Cadangan Data

# backupData
source: Backup Your Data
id: Cadangkan Data Anda

# backupDataDesc
source: Ensure your data is backed up to avoid loss and keep it secure.
id: Pastikan data Anda dicadangkan untuk menghindari kehilangan dan menjaga keamanannya.

# noInternetConnection
source: No internet connection, please try again
id: Tidak ada koneksi internet, silakan coba lagi

# removeDataBackup
source: Remove your data backup?
id: Hapus cadangan data Anda?

# removeDataBackupConfirm
source: Are you sure you want to remove your data backup?
id: Apakah Anda yakin ingin menghapus cadangan data Anda?

source: Cancel
id: Batal

source: Delete
id: Hapus

source: Data Backed Up
id: Data Telah Dicadangkan

source: Data Not Backed Up
id: Data Belum Dicadangkan

# aboutApp
source: About This Application
id: Tentang Aplikasi Ini

# logoutConfirm
source: Logging Out?
id: Keluar?

# logoutConfirmDesc
source: Make sure to backup your data before logging out.
id: Pastikan untuk mencadangkan data Anda sebelum keluar.

source: Save
id: Simpan

source: Date of Birth
id: Tanggal Lahir

source: Edit Profile
id: Edit Profil

source: Change Purpose
id: Ubah Tujuan

# useLastPeriod
source: Use last period cycle data?
id: Gunakan siklus menstruasi terakhir?

source: Selected Date
id: Tanggal yang Dipilih

source: Start Pregnancy
id: Mulai Kehamilan

# blessedWithBaby
source: Blessed with a baby?
id: Dikaruniai bayi?

# babyGirl
source: Yes, it's a Girl
id: Ya, Perempuan

# babyBoy
source: Yes, it's a Boy
id: Ya, Laki laki

source: Delete Pregnancy
id: Hapus Kehamilan

# deletePregnancyConfirm
source: Are you sure you want to delete your current pregnancy?
id: Apakah Anda yakin ingin menghapus kehamilan Anda saat ini?

# deletePregnancyConfirmDesc
source: Deleting the pregnancy will remove all related data due to an event affecting the baby.
id: Menghapus kehamilan akan menghapus semua data terkait kehamilan ini karena sesuatu terjadi pada bayi.

source: End Pregnancy
id: Akhiri Kehamilan

source: Fetal Weight Development
id: Perkembangan Berat Janin

source: Fetal Height Development
id: Perkembangan Tinggi Janin

source: Fetal Weight
id: Berat Janin

source: Fetal Height
id: Tinggi Janin

# weightUnit
source: Fetal Weight (gram)
id: Berat Janin (gram)

# heightUnit
source: Fetal Height (milimeter)
id: Tinggi Janin (milimeter)

source: Week Pregnancy
id: Minggu Kehamilan

source: Week
id: Minggu

source: Pregnancy Food Guide
id: Panduan Makanan Kehamilan

source: Search food...
id: Cari makanan...

source: Read more
id: Baca lebih lanjut

source: Show less
id: Tampilkan lebih sedikit

source: Unsafe
id: Tidak Aman

source: Caution
id: Waspada

source: Safe
id: Aman

source: Fetal Development
id: Perkembangan Janin

source: Weight Gain Tracker
id: Pelacak Berat Badan

source: Vaccine
id: Vaksin

source: Vitamins
id: Vitamin

source: Food
id: Makanan

source: Pregnancy Tools
id: Fitur Kehamilan

source: Pregnancy Vaccine Guide
id: Panduan Vaksin Kehamilan

# pregnancyVaccineGuideDesc
source: Shows recommended vaccines for pregnant women, including their benefits and timing for optimal protection.
id: Menampilkan vaksin yang direkomendasikan untuk ibu hamil, termasuk manfaat dan waktu yang tepat untuk perlindungan optimal.

# pregnancyVitaminGuide
source: Pregnancy Vitamins Guide
id: Panduan Vitamin Kehamilan

# pregnancyVitaminGuideDesc
source: Essential vitamins for pregnant women, including benefits and sources, to support maternal and fetal health.
id: Vitamin penting untuk ibu hamil, termasuk manfaat dan sumbernya, untuk mendukung kesehatan ibu dan janin.

source: Pregnancy Weight Gain Tracker
id: Pelacak Berat Badan Kehamilan

# pregnancyWeightGainTrackerDesc
source: The pregnancy weight gain tracker monitors and records a pregnant woman's weight throughout her pregnancy using BMI to categorize weight status.
id: Pelacak ini memantau dan mencatat berat badan selama kehamilan dengan menggunakan BMI untuk menentukan status berat badan.

# countBMI
source: Enter your height and pre-pregnancy weight
id: Masukkan tinggi badan dan berat badan sebelum hamil

source: Pre-pregnancy weight
id: Berat sebelum hamil

source: Add Pre-Pregnancy Weight
id: Tambah Berat Sebelum Hamil

source: Add
id: Tambah

source: Your height
id: Tinggi Anda

source: Add Height
id: Tambah Tinggi Badan

source: Height
id: Tinggi

# twinBaby
source: Pregnant with twin baby?
id: Hamil anak kembar?

source: Send
id: Kirim

# addNewWeightGain
source: Add new weight gain data
id: Tambah data peningkatan berat badan baru

source: Add New Weight
id: Tambah Berat Baru

# recommendWeek
source: Recommend Weight
id: Rekomendasi Berat

source: Weeks of Pregnancy
id: Minggu Kehamilan

# weightGainUnit
source: Weight Gain (kg)
id: Peningkatan Berat (kg)

source: Recommended Weight Gain Range
id: Rentang Peningkatan Berat yang Disarankan

source: Actual Weight Gain
id: Peningkatan Berat Aktual

source: Starting
id: Awal

source: Current
id: Saat Ini

source: Total Gain
id: Total Peningkatan

source: Recommended Weight Gain
id: Peningkatan Berat yang Disarankan

source: Current Week
id: Minggu Ini

source: Next Week
id: Minggu Depan

source: Previous Record
id: Rekam Jejak Sebelumnya

# dates
source: Date
id: Tanggal

source: Gain
id: Naik / Turun

source: Edit Weight
id: Edit Berat

source: Pregnancy Week
id: Minggu Kehamilan

source: Edit Weight Data
id: Edit Data Berat

source: Delete Weight Data
id: Hapus Data Berat

# shettlesPredictionMethod
source: The Shettles Prediction Method
id: Metode Prediksi Shettles

# shettlesPredictionMethod1
source: Based on the Shettles Method
id: Berdasarkan Metode Shettles

# shettlesPredictionMethod2
source: Aim for intercourse on ovulation day and the next 2-3 days
id: Lakukan hubungan seksual pada hari ovulasi dan 2-3 hari berikutnya

# shettlesPredictionMethod3
source: from {boyStartDate} until {boyEndDate} to likely conceive a male
id: dari {boyStartDate} hingga {boyEndDate} untuk kemungkinan mengandung anak laki-laki

# shettlesPredictionMethod4
source: , and have intercourse from the end of menstruation until three days before ovulation, avoiding sex 2-3 days before ovulation
id: , dan lakukan hubungan seksual dari akhir menstruasi hingga tiga hari sebelum ovulasi, hindari seks 2-3 hari sebelum ovulasi

# shettlesPredictionMethod5
source: from {girlStartDate} until {girlEndDate} to likely conceive a female.
id: dari {girlStartDate} hingga {girlEndDate} untuk kemungkinan mengandung anak perempuan.

# shettlesPredictionMethod6
source: What is The Shettles Method?
id: Apa itu Metode Shettles?

# shettlesPredictionMethod7
source: In the 1960s, Dr. Landrum Shettles began studying sperm to understand how they influence the sex of a fetus. He suggested that sperm differ based on whether they carry an X or Y chromosome. The Shettles method is based on the idea that these differences between male (Y) and female (X) sperm can be used to influence the sex of the fetus. This method recommends specific times for intercourse, preferred sexual positions, and adjustments to the pH of bodily fluids to favor either X or Y sperm reaching the egg first, thereby theoretically determining the sex of the fetus. Dr. Shettles identified key differences between male and female sperm. Male sperm, which carry Y chromosomes, are small with rounded heads, swim faster, and thrive in the alkaline conditions near the cervix. Female sperm, which carry X chromosomes, are larger with oval-shaped heads, swim slower, and survive longer in the acidic conditions of the vagina. Dr. Shettles claimed these differences influenced how quickly sperm could reach the egg and their ability to survive in the vaginal environment. He noted that cervical secretions become more alkaline closer to ovulation, making timing of intercourse critical depending on the desired sex of the fetus.
id: Pada tahun 1960-an, Dr. Landrum Shettles mulai mempelajari sperma untuk memahami bagaimana sperma memengaruhi jenis kelamin janin. Ia menyarankan bahwa sperma berbeda berdasarkan apakah mereka membawa kromosom X atau Y. Metode Shettles didasarkan pada gagasan bahwa perbedaan antara sperma laki-laki (Y) dan perempuan (X) dapat digunakan untuk memengaruhi jenis kelamin janin. Metode ini merekomendasikan waktu tertentu untuk hubungan seksual, posisi seksual yang disukai, dan penyesuaian pH cairan tubuh untuk memihak sperma X atau Y mencapai telur terlebih dahulu, sehingga secara teori menentukan jenis kelamin janin. Dr. Shettles mengidentifikasi perbedaan kunci antara sperma laki-laki dan perempuan. Sperma laki-laki, yang membawa kromosom Y, kecil dengan kepala bulat, berenang lebih cepat, dan berkembang di kondisi alkali dekat serviks. Sperma perempuan, yang membawa kromosom X, lebih besar dengan kepala berbentuk oval, berenang lebih lambat, dan bertahan lebih lama di kondisi asam vagina. Dr. Shettles mengklaim bahwa perbedaan ini memengaruhi seberapa cepat sperma bisa mencapai telur dan kemampuannya bertahan di lingkungan vagina. Ia mencatat bahwa sekresi serviks menjadi lebih alkali mendekati ovulasi, membuat waktu hubungan seksual menjadi kritis tergantung pada jenis kelamin janin yang diinginkan.

# shettlesPredictionMethod8
source: How the method suggests conceiving a female?
id: Bagaimana metode ini menyarankan untuk mengandung anak perempuan?

# shettlesPredictionMethod9
source: According to the Shettles method, the following factors are recommended to conceive a female fetus:
id: Menurut metode Shettles, faktor-faktor berikut disarankan untuk mengandung janin perempuan:

# shettlesPredictionMethod10
source: • Sexual Position: Engage in face-to-face intercourse with shallow penetration. This allows sperm to pass through the acidic environment of the vagina, which is believed to favor female sperm. • Timing of Intercourse: Have sexual intercourse between the end of menstruation and three days before ovulation, then abstain from intercourse 2–3 days before ovulation. • Timing of Female Orgasm: Since the secretions from female orgasm are alkaline, Dr. Shettles recommended that the female should avoid orgasming until after the male has ejaculated. • Douching: Use a douche made from 2 tablespoons of white vinegar mixed with 1 quart of water to create a more acidic environment.
id: • Posisi Seksual: Lakukan hubungan seksual secara face-to-face dengan penetrasi dangkal. Ini memungkinkan sperma melewati lingkungan asam vagina, yang diyakini memihak sperma perempuan. • Waktu Hubungan Seksual: Lakukan hubungan seksual antara akhir menstruasi dan tiga hari sebelum ovulasi, kemudian hindari hubungan seksual 2–3 hari sebelum ovulasi. • Waktu Orgasme Perempuan: Karena sekresi dari orgasme perempuan bersifat alkali, Dr. Shettles merekomendasikan agar perempuan menahan orgasme hingga setelah pria ejakulasi. • Douching: Gunakan douche yang terbuat dari 2 sendok makan cuka putih yang dicampur dengan 1 liter air untuk menciptakan lingkungan yang lebih asam.

# shettlesPredictionMethod11
source: Douching and Safety
id: Douching dan Keamanan

# shettlesPredictionMethod12
source: It's important to note that vaginal douching is not considered safe. The Office on Women’s Health highlights that douching can cause various health issues and may be linked to difficulties in getting pregnant, ectopic pregnancies, and preterm labor. Douching can also increase the risk of vaginal infections, such as yeast infections and bacterial vaginosis. Furthermore, if a person has a vaginal infection, douching can push bacteria into the uterus, ovaries, and fallopian tubes, potentially leading to pelvic inflammatory disease.
id: Penting untuk dicatat bahwa douching vagina tidak dianggap aman. Kantor Kesehatan Wanita menyoroti bahwa douching dapat menyebabkan berbagai masalah kesehatan dan dapat dikaitkan dengan kesulitan dalam hamil, kehamilan ektopik, dan persalinan prematur. Douching juga dapat meningkatkan risiko infeksi vagina, seperti infeksi jamur dan vaginosis bakterialis. Selain itu, jika seseorang memiliki infeksi vagina, douching dapat mendorong bakteri ke dalam rahim, ovarium, dan tuba falopi, yang berpotensi menyebabkan penyakit radang panggul.

# shettlesPredictionMethod13
source: How the Method Suggests Conceiving a Male?
id: Bagaimana Metode Ini Menyarankan Mengandung Anak Laki-laki?

# shettlesPredictionMethod14
source: According to the Shettles method, the following factors are recommended to conceive a male fetus:
id: Menurut metode Shettles, faktor-faktor berikut disarankan untuk mengandung janin laki-laki:

# shettlesPredictionMethod15
source: • Sexual Position: Engage in rear-entry intercourse to achieve deep penetration, depositing sperm closer to the cervix. • Timing of Intercourse: Refrain from sexual intercourse from the beginning of the menstrual cycle until the day of ovulation. Have intercourse on the day of ovulation and the following three days. • Timing of Female Orgasm: The female should orgasm before the male ejaculates to increase alkaline secretions favorable to male sperm. • Douching: Use a douche made from 2 tablespoons of baking soda mixed with 1 quart of water to create an alkaline environment.
id: • Posisi Seksual: Lakukan hubungan seksual rear-entry untuk mencapai penetrasi dalam, menempatkan sperma lebih dekat ke serviks. • Waktu Hubungan Seksual: Hindari hubungan seksual dari awal siklus menstruasi hingga hari ovulasi. Lakukan hubungan seksual pada hari ovulasi dan tiga hari berikutnya. • Waktu Orgasme Perempuan: Perempuan harus orgasme sebelum pria ejakulasi untuk meningkatkan sekresi alkali yang mendukung sperma laki-laki. • Douching: Gunakan douche yang terbuat dari 2 sendok makan baking soda yang dicampur dengan 1 liter air untuk menciptakan lingkungan yang lebih alkali.

# shettlesPredictionMethod16
source: Does It Really Work?
id: Apakah Metode Ini Benar-benar Bekerja?
