Repository: Meddd20/menstrual_calender
Catalog: lib/l10n/app_*.arb
Languages: id

# babyKicksInfoDesc
source: Fetal movement is a sign that the baby in the womb is growing well, both in size and strength. The first movements felt by pregnant mothers are known as quickening, which typically occurs between weeks 16 and 22. This indicates that the fetus is actively moving within the uterus. As the third trimester approaches, it’s important to start monitoring fetal movements more regularly, usually beginning around 28 weeks of pregnancy. One recommended method is the count to 10, where the mother counts the number of baby movements over a two-hour period, typically when the baby is most active, such as after eating. If the mother does not feel at least 10 movements during this two-hour window, it is advised to contact a doctor or healthcare provider immediately. A decrease in fetal movement can be a sign that something may be wrong and needs to be addressed. By regularly monitoring the baby's movements, mothers can be more proactive in ensuring the fetus's health and seeking help if necessary. This is all about ensuring a healthy and safe pregnancy!
id: Gerakan janin adalah tanda bahwa bayi di dalam kandungan tumbuh dengan baik, baik dari segi ukuran maupun kekuatan. Gerakan pertama yang dirasakan oleh ibu hamil dikenal sebagai quickening, biasanya terjadi antara minggu ke-16 hingga minggu ke-22. Ini menandakan bahwa janin aktif bergerak di dalam rahim. Memasuki trimester ketiga, penting untuk mulai memantau gerakan janin secara lebih rutin, biasanya dimulai sekitar usia kehamilan 28 minggu. Salah satu metode yang dianjurkan adalah hitungan 10, di mana ibu menghitung jumlah gerakan bayi dalam waktu dua jam, biasanya pada saat si bayi paling aktif, seperti setelah makan. Jika dalam dua jam tersebut ibu tidak merasakan minimal 10 gerakan, disarankan untuk segera menghubungi dokter atau penyedia layanan kesehatan. Pengurangan gerakan janin bisa menjadi tanda bahwa ada sesuatu yang tidak beres dan perlu ditindaklanjuti. Dengan memantau gerakan bayi secara teratur, ibu bisa lebih proaktif dalam menjaga kesehatan janin dan mendapatkan bantuan jika diperlukan. Ini semua demi memastikan bahwa kehamilan berjalan dengan sehat dan aman!

# contractionInfo
source: What Are Contractions and Why Is It Important to Track Them?
id: Apa Itu Kontraksi dan Mengapa Penting Mencatatnya?

# contractionDesc
source: The uterus is shaped like an inverted pear, with the upper part called the fundus and the lower part called the cervix, which connects the uterus to the vagina. During pregnancy, the muscular walls of the uterus will grow and stretch as the baby develops. When it’s time to give birth, the muscles of the uterus will contract rhythmically to help push the baby down and open the cervix for delivery.
id: Rahim berbentuk seperti buah pir terbalik, dengan bagian atasnya disebut fundus dan bagian bawahnya disebut serviks, yang menghubungkan rahim dengan vagina. Selama kehamilan, dinding rahim yang terdiri dari otot akan tumbuh dan merenggang seiring perkembangan bayi. Ketika waktunya melahirkan tiba, otot-otot rahim akan berkontraksi secara ritmis untuk membantu mendorong bayi turun dan membuka serviks agar bayi bisa lahir.

# whyTrackingContractionImportant
source: Why Is It Important to Track Contractions?
id: Mengapa Penting Mencatat Kontraksi?

# whyTrackingContractionImportantDesc
source: Tracking contractions is crucial as it helps you and your healthcare provider understand what is happening in your body. Here are some reasons why recording contractions is beneficial: 1. Distinguishing Braxton Hicks Contractions from Labor Contractions: By noting the frequency, duration, and intensity of contractions, you can differentiate between Braxton Hicks—mild and irregular contractions often referred to as practice—and actual labor contractions, which are stronger, regular, and closer together. This helps you determine when it's time to head to the hospital. 2. Avoiding Excessive Worry: Many first-time pregnant women feel anxious when they experience Braxton Hicks contractions, even though this is normal. By tracking contraction patterns, you can feel more at ease knowing that these contractions are not signs of true labor. 3. Predicting Labor: Contractions that become stronger and more regular are usually signs that labor is approaching. Tracking this pattern can help you and your doctor understand whether labor has started or if the contractions are still too early. 4. Supporting Decisions on When to Go to the Hospital: When contractions are becoming stronger and closer together (typically every 5 minutes and lasting for 1 minute or more), it’s time to head to a healthcare facility. Accurately recording contraction times can ensure you arrive at the hospital at the right moment. 5. Providing Comprehensive Information to Healthcare Providers: When you visit your doctor or midwife, they often ask about the frequency and duration of your contractions. With organized records, you can provide accurate and complete information, helping them make the best decisions regarding your labor.
id: Mencatat kontraksi sangat penting karena membantu kamu dan tenaga medis memahami apa yang sedang terjadi dengan tubuhmu. Berikut beberapa alasan mengapa pencatatan kontraksi bermanfaat: 1. Membedakan Kontraksi Braxton Hicks dan Kontraksi Persalinan: Dengan mencatat frekuensi, durasi, dan intensitas kontraksi, kamu bisa membedakan antara Braxton Hicks—kontraksi ringan dan tidak teratur yang sering disebut sebagai “latihan”—dengan kontraksi persalinan sebenarnya, yang lebih kuat, teratur, dan semakin mendekat satu sama lain. Ini membantu kamu menentukan kapan waktunya bersiap ke rumah sakit. 2. Menghindari Kekhawatiran Berlebih: Banyak ibu hamil pertama kali merasa cemas ketika merasakan kontraksi Braxton Hicks, padahal ini adalah hal yang normal. Dengan mencatat pola kontraksi, kamu bisa lebih tenang karena tahu bahwa kontraksi yang terjadi belum tanda persalinan sebenarnya. 3. Memprediksi Persalinan: Kontraksi yang semakin kuat dan teratur biasanya adalah tanda bahwa persalinan sudah dekat. Mencatat pola ini bisa membantu kamu dan dokter mengetahui apakah persalinan sudah dimulai, atau apakah kontraksi masih terlalu awal. 4. Mendukung Keputusan Kapan ke Rumah Sakit: Saat kontraksi sudah semakin kuat dan jarak antar kontraksi semakin dekat (biasanya setiap 5 menit dan berlangsung selama 1 menit atau lebih), ini adalah waktu yang tepat untuk segera menuju fasilitas kesehatan. Mencatat waktu kontraksi secara akurat bisa membantu memastikan kamu tiba di rumah sakit pada waktu yang tepat. 5. Memberikan Informasi Lengkap ke Tenaga Medis: Saat kamu pergi ke dokter atau bidan, mereka sering bertanya mengenai frekuensi dan durasi kontraksi. Dengan catatan yang rapi, kamu bisa memberikan informasi yang akurat dan lengkap, yang akan membantu mereka membuat keputusan terbaik mengenai persalinanmu.

# twoTypeContraction
source: Two Types of Contractions to Watch For:
id: Dua Jenis Kontraksi yang Perlu Diperhatikan:

# twoTypeContractionDesc
source: Braxton Hicks Contractions: These are irregular contractions, often not painful, and serve more as practice for the uterus before true labor. Typically, these contractions do not cause the cervix to open. Labor Contractions: These are the actual contractions that occur at regular intervals and become stronger. They help open the cervix and push the baby down, signaling that labor is in progress. By routinely tracking contractions, you can be better prepared and calmer when facing labor, ensuring that you receive medical support at the right time.
id: Kontraksi Braxton Hicks: Ini adalah kontraksi yang tidak teratur, sering kali tidak terasa sakit, dan lebih sebagai latihan rahim sebelum persalinan sebenarnya. Biasanya kontraksi ini tidak menyebabkan serviks terbuka. Kontraksi Persalinan: Ini adalah kontraksi sebenarnya yang muncul pada interval teratur dan semakin kuat. Kontraksi ini membantu membuka serviks dan mendorong bayi turun, tanda bahwa persalinan sedang berlangsung. Dengan mencatat kontraksi secara rutin, kamu bisa lebih siap dan tenang menghadapi persalinan, serta memastikan bahwa kamu mendapatkan dukungan medis pada waktu yang tepat.

# weightChanges
source: Weight Changes During Pregnancy
id: Perubahan Berat Badan Selama Kehamilan

# weightChangesDesc
source: Pregnancy brings many changes to the body, and one of the most noticeable changes is weight gain. This increase is important because it helps ensure nutrition for the baby's growth and prepares the body for breastfeeding after delivery. While this weight gain is normal and necessary, maintaining weight within the recommended range based on pre-pregnancy BMI (Body Mass Index) will help keep both mother and baby healthy. What Is BMI? BMI is a comparison between weight and height calculated in kilograms per square meter (kg/m²). It helps determine whether your weight before pregnancy falls into the categories of underweight, normal, overweight, or obese. Each category has different recommendations for weight gain during pregnancy.
id: Kehamilan membawa banyak perubahan pada tubuh, dan salah satu perubahan yang paling terasa adalah peningkatan berat badan. Peningkatan ini penting karena membantu tubuh memastikan nutrisi untuk pertumbuhan bayi dan mempersiapkan tubuh untuk menyusui setelah melahirkan. Meski kenaikan berat badan ini normal dan dibutuhkan, menjaga berat badan agar tetap dalam rentang yang disarankan berdasarkan BMI (Indeks Massa Tubuh) sebelum kehamilan akan membantu ibu dan bayi tetap sehat. Apa Itu BMI? BMI adalah perbandingan antara berat badan dan tinggi badan yang dihitung dalam satuan kilogram per meter kuadrat (kg/m²). BMI ini membantu mengetahui apakah berat badanmu sebelum hamil termasuk kategori underweight (kurang), normal, overweight (kelebihan berat), atau obese (obesitas). Masing-masing kategori punya rekomendasi kenaikan berat badan yang berbeda selama kehamilan.

# recommendWeightInfoTitle
source: Recommended Weight Gain Based on Pre-Pregnancy BMI:
id: Rekomendasi Kenaikan Berat Badan Berdasarkan BMI Sebelum Hamil:

# recommendWeightInfo
source: • Underweight (BMI < 18.5): Gain about 12.5 - 18 kg during pregnancy, or 0.5 kg per week in the second and third trimesters. • Normal (BMI 18.5 - 24.9): Gain 11.5 - 16 kg, or about 0.4 kg per week. • Overweight (BMI 25 - 29.9): Gain less, around 7 - 11.5 kg, or 0.3 kg per week. • Obese (BMI > 30): Recommended gain is about 5 - 9 kg, or 0.2 kg per week.
id: • Underweight (BMI < 18.5): Kenaikan sekitar 12,5 - 18 kg selama kehamilan, atau 0,5 kg per minggu pada trimester kedua dan ketiga. • Normal (BMI 18.5 - 24.9): Kenaikan 11,5 - 16 kg, atau sekitar 0,4 kg per minggu. • Overweight (BMI 25 - 29.9): Kenaikan lebih sedikit, sekitar 7 - 11,5 kg, atau 0,3 kg per minggu. • Obese (BMI > 30): Disarankan kenaikan sekitar 5 - 9 kg, atau 0,2 kg per minggu.

# recommendWeightInfoDesc
source: In the first trimester, weight typically only increases by about 0.5 - 2 kg, as the body starts to adapt to pregnancy and there is early development of the placenta and increased blood volume. Why Is This Weight Gain Important? Most of the weight gained during pregnancy comes from the baby, placenta, amniotic fluid, as well as increased blood volume and body fat. All of this is crucial for maintaining the health of both mother and baby, and for ensuring sufficient energy for breastfeeding after delivery. Controlled weight gain also influences the baby's birth weight, so it is highly recommended to follow appropriate weight gain guidelines based on pre-pregnancy BMI.
id: Di trimester pertama, biasanya berat badan hanya naik sekitar 0,5 - 2 kg, karena tubuh mulai beradaptasi dengan kehamilan dan terjadi perkembangan awal plasenta serta peningkatan volume darah.

# whyWeightGainImportant
source: Why Is This Weight Gain Important? Most of the weight gained during pregnancy comes from the baby, placenta, amniotic fluid, as well as increased blood volume and body fat. All of this is crucial for maintaining the health of both mother and baby, and for ensuring sufficient energy for breastfeeding after delivery. Controlled weight gain also influences the baby's birth weight, so it is highly recommended to follow appropriate weight gain guidelines based on pre-pregnancy BMI.
id: Kenapa Kenaikan Berat Badan Ini Penting? Sebagian besar kenaikan berat badan selama kehamilan datang dari bayi, plasenta, cairan ketuban, serta peningkatan volume darah dan lemak tubuh. Semua itu penting untuk menjaga kesehatan ibu dan bayi, serta memastikan energi yang cukup untuk menyusui setelah melahirkan. Kenaikan berat badan yang terkontrol juga memengaruhi berat lahir bayi, sehingga sangat disarankan untuk mengikuti panduan kenaikan berat badan yang tepat sesuai BMI sebelum hamil.

# pregnancyDailyLog
source: Why Is It Important to Keep Records During Pregnancy?
id: Kenapa Penting Mencatat Selama Kehamilan?

# pregnancyDailyLogDesc
source: Keeping a diary during pregnancy can be a mother's best companion for monitoring health and the progress of the pregnancy. By recording various things, such as: • Pregnancy Symptoms: For example, nausea, dizziness, or other changes experienced. • Body Temperature: Recording body temperature, especially in the first trimester, is important for spotting early signs of pregnancy and monitoring hormonal changes. • Additional Notes: Other things you may want to note, like daily activities or specific feelings. Why is this important? By regularly keeping records, you help healthcare providers better understand your condition, detect issues early, and provide appropriate interventions when needed. Additionally, you can observe patterns in symptoms that may recur during different stages of pregnancy. For instance, recording body temperature can help identify unusual fluctuations. An increase in basal temperature often occurs in early pregnancy due to hormonal changes. If there are abnormal fluctuations, such as a significant drop or rise, it may indicate problems like an infection. By documenting all these aspects, you can connect more with your health and assist healthcare providers in ensuring a healthy and safe pregnancy.
id: Catatan harian selama kehamilan bisa jadi sahabat terbaik ibu hamil untuk memantau kondisi kesehatan dan perkembangan kehamilan. Dengan mencatat beberapa hal, seperti: • Gejala kehamilan: Misalnya mual, pusing, atau perubahan lainnya yang dirasakan. • Suhu tubuh: Pencatatan suhu tubuh, terutama di trimester pertama, penting untuk melihat tanda-tanda awal kehamilan dan memantau perubahan hormon. • Catatan tambahan: Hal-hal lain yang ingin dicatat seperti aktivitas harian atau perasaan tertentu. Kenapa ini penting? Dengan rutin mencatat, kamu membantu tenaga medis lebih mudah memahami kondisimu, mendeteksi masalah lebih awal, dan memberikan intervensi yang tepat bila diperlukan. Selain itu, kamu juga bisa melihat pola gejala yang mungkin berulang selama berbagai tahap kehamilan. Mencatat suhu tubuh, misalnya, bisa membantu mengenali fluktuasi yang tak biasa. Peningkatan suhu basal biasanya terjadi di awal kehamilan karena perubahan hormon. Jika ada fluktuasi yang tidak wajar, seperti penurunan atau kenaikan drastis, hal itu bisa menjadi tanda adanya masalah seperti infeksi. Dengan mencatat semua aspek ini, kamu bisa lebih terhubung dengan kesehatanmu sendiri dan membantu tenaga medis memastikan kehamilan yang sehat dan aman.

# dateOfBirthSelection
source: Please select your date of birth.
id: Silakan pilih tanggal lahir Anda.

# periodRangeSelectionRequired
source: Please select at least one period range.
id: Silakan pilih setidaknya satu rentang periode.

# periodRangeLimit
source: Please select only 3 period range.
id: Silakan pilih hanya 3 rentang periode.

# lastPeriodFirstDaySelection
source: Please select the first day of your last period.
id: Silakan pilih hari pertama dari periode terakhir Anda.

# emptyVerificationCode
source: Verification code are empty, please fill the verification code.
id: Kode verifikasi kosong, silakan isi kode verifikasi.

# genericError
source: An error occurred. Please try again later.
id: Terjadi kesalahan. Silakan coba lagi nanti.
