Repository: Meddd20/menstrual_calender
Catalog: lib/l10n/app_*.arb
Languages: id

# pregnancyLogSaveFailed
source: Failed to save pregnancy log. Please try again!
id: Gagal menyimpan catatan kehamilan. Silakan coba lagi!

# pregnancyLogResetFailed
source: Failed to reset pregnancy log. Please try again!
id: Gagal mereset catatan kehamilan. Silakan coba lagi!

# weightGainInitializedSuccess
source: Weight gain initialized successfully!
id: Peningkatan berat badan berhasil diinisialisasi!

# weightGainInitializeFailed
source: Failed to initialize weight gain. Please try again!
id: Gagal menginisialisasi peningkatan berat badan. Silakan coba lagi!

# weightGainAddedSuccess
source: Weight gain added successfully!
id: Peningkatan berat badan berhasil ditambahkan!

# weightGainAddFailed
source: Failed to add weight gain. Please try again!
id: Gagal menambahkan peningkatan berat badan. Silakan coba lagi!

# weightGainDeletedSuccess
source: Weight gain deleted successfully!
id: Peningkatan berat badan berhasil dihapus!

# weightGainDeleteFailed
source: Failed to delete weight gain. Please try again!
id: Gagal menghapus peningkatan berat badan. Silakan coba lagi!

# profileEditedSuccess
source: Profile edited successfully!
id: Profil berhasil diedit!

# profileEditFailed
source: Failed to edit profile. Please try again!
id: Gagal mengedit profil. Silakan coba lagi!

# pregnancyStartedSuccess
source: Pregnancy started successfully!
id: Kehamilan berhasil dimulai!

# pregnancyStartFailed
source: Failed to begin pregnancy. Please try again!
id: Gagal memulai kehamilan. Silakan coba lagi!

# pregnancyEndedSuccess
source: Pregnancy ended successfully!
id: Kehamilan berhasil diakhiri!

# pregnancyEndFailed
source: Failed to end pregnancy. Please try again!
id: Gagal mengakhiri kehamilan. Silakan coba lagi!

# pregnancyDeletedSuccess
source: Pregnancy deleted successfully!
id: Kehamilan berhasil dihapus!

# pregnancyDeleteFailed
source: Failed to delete pregnancy. Please try again!
id: Gagal menghapus kehamilan. Silakan coba lagi!

# reminderSelectDate
source: Please select a date when the reminder will be triggered
id: Silakan pilih tanggal saat pengingat akan diaktifkan

# reminderSelectTime
source: Please select a time when the reminder will be triggered
id: Silakan pilih waktu saat pengingat akan diaktifkan

# reminderFillTitle
source: Please fill out the reminder title
id: Silakan isi judul pengingat

# reminderFillDescription
source: Please fill out the reminder description
id: Silakan isi deskripsi pengingat

# weightInitializedHeight
source: Please enter your height
id: Silahkan masukkan tinggi badan

# weightInitializedWeight
source: Please enter your pre-pregnancy weight
id: Silahkan masukkan berat badan pra-kehamilan

# noInternetHeader
source: Connection Lost
id: Koneksi Internet Terputus

# noInternetBody
source: Your internet connection seems to be offline. Please check your network settings.
id: Tidak dapat terhubung ke server. Periksa koneksi internet Anda dan coba lagi.

source: Altered Body Image
id: Perubahan Penampilan Tubuh

source: Anxiety
id: Cemas

source: Back Pain
id: Sakit Punggung

source: Breast Pain
id: Nyeri Payudara

source: Brownish Marks on Face
id: Bercak Cokelat di Wajah

source: Carpal Tunnel
id: Sindrom Carpal Tunnel

source: Changes in Libido
id: Perubahan Gairah Seks

source: Changes in Nipples
id: Perubahan pada Puting

source: Dry Mouth
id: Mulut Kering

source: Fainting
id: Pingsan

source: Feeling Depressed
id: Merasa Sedih

source: Food Cravings
id: Ngidam Makanan

source: Forgetfulness
id: Sering Lupa

source: Greasy Skin/Acne
id: Kulit Berminyak/Jerawat

source: Haemorrhoids
id: Ambeien

source: Heart Palpitations
id: Jantung Berdebar

source: Hip/Pelvic Pain
id: Nyeri Pinggul/Panggul

source: Increased Vaginal Discharge
id: Keputihan Berlebih

source: Incontinence/Leaking Urine
id: Sulit Menahan Buang Air Kecil

source: Itchy Skin
id: Gatal-gatal

source: Leg Cramps
id: Kram Kaki

source: Painful Vaginal Veins
id: Nyeri pada Pembuluh Vagina

source: Poor Sleep
id: Tidur Tidak Nyenyak

source: Reflux
id: Asam Lambung Naik

source: Restless Legs
id: Kaki Gelisah

source: Shortness of Breath
id: Sesak Napas

source: Sciatica
id: Nyeri Saraf Sciatica

source: Snoring
id: Mendengkur

source: Sore Nipples
id: Puting Sakit

source: Stretch Marks
id: Garis-garis di Kulit

source: Swollen Hands/Feet
id: Tangan/Kaki Bengkak

source: Taste/Smell Changes
id: Perubahan Rasa/Bau

source: Thrush
id: Infeksi Jamur

source: Tiredness/Fatigue
id: Kelelahan

source: Urinary Frequency
id: Sering Buang Air Kecil

source: Varicose Veins
id: Varises

source: Vivid Dreams
id: Mimpi yang Jelas

source: Vomiting
id: Muntah

source: Start Date
id: Tanggal Mulai

source: End Date
id: Tanggal Selesai

source: Sun
id: Min

source: Mon
id: Sen

source: Tue
id: Sel

source: Wed
id: Rab

source: Thu
id: Kam

source: Fri
id: Jum

source: Sat
id: Sab

source: Highlight
id: Sorotan

source: Body Changes
id: Perubahan Tubuh

source: Your Baby Development
id: Perkembangan Bayi Anda

source: Report Birth
id: Catat Kelahiran

# babyBirthCongratsTitle
source: Congratulations on your little bundle of joy!
id: Selamat atas si kecil Anda!

# babyBirthCongratsDescription
source: Wishing your family endless love, happiness, and cherished memories.
id: Semoga keluarga Anda dipenuhi dengan cinta, kebahagiaan, dan kenangan berharga.

# babyBirthLossTitle
source: We are deeply sorry for your loss...
id: Kami sangat menyesal atas kehilangan Anda...

# babyBirthLossDescription
source: Wishing you strength, peace, and comfort during this incredibly difficult time. Our thoughts and hearts are with you, and we hope you find solace in the love and support around you.
id: Semoga Anda mendapatkan kekuatan, kedamaian, dan kenyamanan selama masa yang sangat sulit ini. Pikiran dan hati kami bersama Anda, dan kami berharap Anda menemukan ketenangan dalam cinta dan dukungan di sekitar Anda.

# hasYourPeriodReturn
source: Has your period returned yet after childbirth?
id: Apakah haid Anda sudah kembali setelah melahirkan?

source: Record your period
id: Catat haid Anda

# commonlyAskedQuestion
source: Commonly Asked Questions
id: Pertanyaan yang Sering Diajukan

# whatToExpectAfterBirth
source: What can I expect after the birth?
id: Apa yang bisa saya harapkan setelah melahirkan?

# whatToExpectAfterBirthDesc
source: After giving birth, whether via C-section or vaginal delivery, you will experience bleeding known as lochia for six to eight weeks, which is different from menstruation. Initially, lochia is deep red and may include blood clots as large as a plum. Over time, it becomes more watery and changes to pink or brown, eventually turning whitish or yellowish before tapering off. During this period, it's important to use menstrual or maternity pads and avoid tampons or anything inserted into the vagina for at least six weeks.
id: Setelah melahirkan, baik melalui operasi Caesar atau persalinan normal, Anda akan mengalami pendarahan yang dikenal sebagai lochia selama enam hingga delapan minggu, yang berbeda dari menstruasi. Pada awalnya, lochia berwarna merah tua dan mungkin termasuk gumpalan darah sebesar plum. Seiring waktu, lochia akan menjadi lebih berair dan berubah menjadi pink atau coklat, akhirnya menjadi putih kekuningan sebelum berkurang. Selama periode ini, penting untuk menggunakan pembalut menstruasi atau maternitas dan menghindari tampon atau benda apapun yang dimasukkan ke dalam vagina selama setidaknya enam minggu.

# sourceFrom
source: Source from: {source}
id: Sumber dari: {source}

# whenWillMyPeriodReturn
source: When will my periods return?
id: Kapan haid saya akan kembali?

# whenWillMyPeriodeReturnDesc
source: Breastfeeding often delays the return of menstruation due to increased prolactin, the hormone responsible for milk production. Full-time breastfeeding typically prevents periods until nursing is reduced or stopped. Parents who bottle-feed or partially breastfeed may get their periods as early as five weeks postpartum. Over two-thirds of parents who don’t breastfeed regain their period within 12 weeks, while only about 20% of breastfeeding parents experience their period within six months. Periods usually return one to two months after stopping or significantly reducing breastfeeding.
id: Menyusui seringkali menunda kembalinya menstruasi karena peningkatan prolaktin, hormon yang bertanggung jawab untuk produksi susu. Menyusui secara penuh biasanya mencegah haid hingga menyusui dikurangi atau dihentikan. Orang tua yang memberikan susu formula atau menyusui sebagian mungkin mendapatkan haid mereka secepat lima minggu setelah melahirkan. Lebih dari dua pertiga orang tua yang tidak menyusui mendapatkan haid mereka dalam waktu 12 minggu, sementara hanya sekitar 20% orang tua yang menyusui mengalami haid dalam waktu enam bulan. Haid biasanya kembali satu hingga dua bulan setelah berhenti atau mengurangi menyusui secara signifikan.

source: Can I still get pregnant?
id: Bisakah saya masih hamil?

# canIStillGetPregnantDesc
source: Even if breastfeeding delays the return of your period, there's still a small chance of getting pregnant, as ovulation can occur during this time. The risk of pregnancy is between one and five percent. It's important to consider using birth control methods to manage this risk effectively.
id: Meskipun menyusui menunda kembalinya haid Anda, masih ada kemungkinan kecil untuk hamil, karena ovulasi bisa terjadi selama waktu ini. Risiko kehamilan berkisar antara satu hingga lima persen. Penting untuk mempertimbangkan menggunakan metode kontrasepsi untuk mengelola risiko ini secara efektif.

# howMyPeriodChangesAfterPregnancy
source: How's my period changes after pregnancy?
id: Bagaimana perubahan haid saya setelah kehamilan?

# howMyPeriodChangesAfterPregnancyDesc
source: When your period returns after childbirth, it may differ from before. It could be heavier, with more or less cramping, and may be irregular, especially if you're still breastfeeding. You might notice more clotting initially, and if clots persist for a week, experts recommend seeking medical advice. Some people find their periods become easier due to the uterus stretching and relaxing, while others experience more difficult periods because of the larger uterus shedding more tissue each cycle. For those with endometriosis, periods may improve temporarily after pregnancy but usually return to being more painful after a few months.
id: Ketika haid Anda kembali setelah melahirkan, mungkin berbeda dari sebelumnya. Haid bisa lebih berat, dengan kram yang lebih banyak atau lebih sedikit, dan mungkin tidak teratur, terutama jika Anda masih menyusui. Anda mungkin akan melihat lebih banyak gumpalan pada awalnya, dan jika gumpalan bertahan selama seminggu, para ahli menyarankan untuk mencari nasihat medis. Beberapa orang menemukan bahwa haid mereka menjadi lebih mudah karena rahim yang meregang dan rileks, sementara yang lain mengalami haid yang lebih sulit karena rahim yang lebih besar mengeluarkan lebih banyak jaringan setiap siklus. Bagi mereka yang memiliki endometriosis, haid mungkin membaik sementara setelah kehamilan tetapi biasanya kembali menjadi lebih menyakitkan setelah beberapa bulan.

source: Recovery after miscarriage
id: Pemulihan setelah keguguran

# recoveryAfterMiscarriageDesc
source: Recovering from a miscarriage involves a physical recovery period of 1 to 2 months, with your period expected to start within 4 to 6 weeks. During this time, avoid using tampons and refrain from sex for 1 to 2 weeks. Emotional healing can take longer, especially if you were aware of the pregnancy, and may include feelings of anger and sadness. Your partner might also experience grief. To help manage these emotions, consider consulting a therapist or grief counselor, joining a support group, and leaning on supportive friends and family.
id: Pemulihan dari keguguran melibatkan periode pemulihan fisik selama 1 hingga 2 bulan, dengan haid Anda diharapkan mulai dalam 4 hingga 6 minggu. Selama periode ini, hindari menggunakan tampon dan hindari berhubungan seks selama 1 hingga 2 minggu. Penyembuhan emosional dapat memakan waktu lebih lama, terutama jika Anda mengetahui kehamilan tersebut, dan mungkin meliputi perasaan marah dan sedih. Pasangan Anda juga mungkin mengalami kesedihan. Untuk membantu mengelola emosi ini, pertimbangkan untuk berkonsultasi dengan terapis atau konselor dukungan, bergabung dengan kelompok dukungan, dan bergantung pada teman dan keluarga yang mendukung.

# whenToTryAgainAfterMiscarriage
source: When is it okay to try again after miscarriage?
id: Kapan saat yang tepat untuk mencoba lagi setelah keguguran?

# whenToTryAgainAfterMiscarriageDesc
source: Most women who experience a miscarriage are able to have successful pregnancies in the future. It's generally recommended to consult your doctor to determine the appropriate waiting period before trying to conceive again, with some suggesting waiting until you've had one to three normal menstrual cycles. Additionally, ensure you are emotionally ready before attempting to get pregnant again. If you have had more than two miscarriages, discuss with your doctor potential underlying issues and the best strategies to support a successful pregnancy.
id: Kebanyakan wanita yang mengalami keguguran dapat memiliki kehamilan yang sukses di masa depan. Umumnya disarankan untuk berkonsultasi dengan dokter Anda untuk menentukan periode menunggu yang tepat sebelum mencoba hamil lagi, dengan beberapa menyarankan menunggu hingga Anda telah memiliki satu hingga tiga siklus menstruasi normal. Selain itu, pastikan Anda siap secara emosional sebelum mencoba untuk hamil lagi. Jika Anda telah mengalami lebih dari dua keguguran, diskusikan dengan dokter Anda masalah yang mungkin mendasarinya dan strategi terbaik untuk mendukung kehamilan yang sukses.

source: Recovery after abortion
id: Pemulihan setelah aborsi

# recoveryAfterAbortionDesc
source: Recovery after an abortion typically involves resting initially, with most people able to return to work and regular activities the following day, depending on their comfort level. It's important to avoid strenuous exercise and any movements that cause pain for the first few days. If you were prescribed pain medications, avoid driving for 8 hours, or a full day if you received IV drugs. Most doctors recommend waiting 2-3 weeks before resuming sexual activity or inserting anything into your vagina, particularly after a surgical abortion. Follow your doctor's instructions regarding any prescribed medications to manage bleeding or prevent infection, and attend all follow-up appointments to ensure the abortion was complete.
id: Pemulihan setelah aborsi umumnya melibatkan istirahat awal, dengan kebanyakan orang dapat kembali bekerja dan melanjutkan aktivitas normal keesokan harinya, tergantung pada tingkat kenyamanan mereka. Penting untuk menghindari olahraga berat dan gerakan yang menyebabkan rasa sakit selama beberapa hari pertama. Jika Anda diberi obat pereda nyeri, hindari mengemudi selama 8 jam, atau sehari penuh jika Anda menerima obat IV. Sebagian besar dokter menyarankan untuk menunggu 2-3 minggu sebelum melanjutkan aktivitas seksual atau memasukkan apapun ke dalam vagina, terutama setelah aborsi bedah. Ikuti petunjuk dokter Anda mengenai obat yang diresepkan untuk mengelola pendarahan atau mencegah infeksi, dan hadiri semua janji tindak lanjut untuk memastikan aborsi selesai.

# whenWillPeriodStartAfterAbortion
source: When will my period start after abortion?
id: Kapan haid saya mulai setelah aborsi?

# whenWillPeriodStartAfterAbortionDesc
source: Your menstrual period is likely to resume 4 to 6 weeks after an abortion, though it's possible to become pregnant before your period returns. Many birth control methods can be started immediately after an abortion or even the same day, including IUDs, implants, pills, patches, shots, and vaginal rings. An IUD or implant can be placed right after a surgical abortion, while an implant can be started with your first pill if you had a medical abortion. For a second-trimester abortion, wait about 6 weeks for your cervix to return to its normal size before using a diaphragm or cervical cap.
id: Haid Anda kemungkinan akan kembali dalam 4 hingga 6 minggu setelah aborsi, meskipun mungkin Anda bisa hamil sebelum haid Anda kembali. Banyak metode kontrasepsi dapat dimulai segera setelah aborsi atau bahkan pada hari yang sama, termasuk IUD, implan, pil, tambalan, suntikan, dan cincin vagina. IUD atau implan dapat dipasang langsung setelah aborsi bedah, sementara implan dapat dimulai dengan pil pertama Anda jika Anda melakukan aborsi medis. Untuk aborsi trimester kedua, tunggu sekitar 6 minggu agar serviks Anda kembali ke ukuran normal sebelum menggunakan diafragma atau penutup serviks.

# pregnancyUpdates
source: Any updates about your pregnancy?
id: Ada kabar terbaru tentang kehamilanmu?

# updatePeriodCycleDesc
source: Update the start and end dates of a specific time period for precise and current tracking.
id: Perbarui tanggal mulai dan berakhir dari periode menstruasi tertentu untuk pelacakan yang akurat dan terkini.

# postPregnancyMenstrualCycle
source: Manage Post-Pregnancy Menstrual Cycle
id: Atur Siklus Menstruasi Pasca Kehamilan

# postPregnancyMenstrualCycleDesc
source: Track your menstrual cycle after pregnancy by entering the date range of your first period.
id: Lacak siklus menstruasi Anda setelah kehamilan dengan memasukkan rentang tanggal menstruasi pertama Anda.

# dailyLogInfo
source: What Is a Daily Log?
id: Apa Itu Catatan Harian?

# dailyLogInfoDesc
source: A daily log is an important feature that allows you to record various information related to your menstrual cycle, such as: • Blood Flow: How heavy or light is it? • Sexual Activity: To help you be more aware of your cycle. • Physical Symptoms: Such as pain or cramps. • Mood Changes: Are your moods fluctuating? This could be an important indicator. • Physical Activity, Weight, Body Temperature: To observe your body patterns. Why is this important? By keeping a routine log, you can better understand your body. You can see patterns that occur during your menstrual cycle, recognize changes, and even detect potential health issues earlier. This log also helps you feel more in control, plan your daily activities better, and makes it easier when consulting with your doctor.
id: Catatan harian adalah fitur penting yang memungkinkan kamu untuk mencatat berbagai informasi terkait siklus menstruasi, seperti: • Aliran darah: Seberapa banyak atau sedikit? • Aktivitas seksual: Agar kamu bisa lebih aware dengan siklusmu. • Gejala fisik: Seperti nyeri atau kram. • Perubahan suasana hati: Mood naik-turun? Ini bisa jadi indikator yang penting. • Aktivitas fisik, berat badan, suhu tubuh: Untuk melihat pola tubuhmu. Kenapa ini penting? Dengan mencatat secara rutin, kamu bisa lebih memahami tubuhmu. Kamu bisa lihat pola yang terjadi selama siklus menstruasi, mengenali perubahan yang terjadi, bahkan mendeteksi masalah kesehatan lebih awal. Catatan ini juga membantu kamu merasa lebih terkontrol, merencanakan aktivitas sehari-hari dengan lebih baik, serta memudahkanmu saat berkonsultasi dengan dokter.

# bloodPressureInfo
source: Why Is Monitoring Blood Pressure Important During Pregnancy?
id: Mengapa Memantau Tekanan Darah Itu Penting Selama Kehamilan?

# bloodPressureInfoDesc
source: Blood pressure is the force exerted by blood as it flows through blood vessels from the heart to the rest of the body. Normal readings are usually around 120/80 mmHg, but they can change depending on various factors like physical activity, diet, and stress. During pregnancy, it’s crucial to monitor blood pressure because high blood pressure or hypertension can pose risks for both the mother and the baby. Hypertension can present in several forms, such as chronic hypertension that existed before pregnancy or gestational hypertension that appears after the 20th week. There’s also preeclampsia, characterized by a sudden spike in blood pressure accompanied by other symptoms, which can be very dangerous. If left untreated, hypertension can reduce blood flow to the placenta, meaning the fetus may not receive enough oxygen and nutrients, potentially leading to growth issues or premature birth. Additionally, hypertension increases the risk of complications such as placental abruption, where the placenta separates from the uterine wall, which can cause severe bleeding. Regularly monitoring blood pressure helps you and your doctor detect problems early, allowing for timely interventions to ensure the health of both the mother and the baby. By understanding the importance of tracking blood pressure, you can be more proactive in maintaining your health during pregnancy. If you notice any concerning signs, don’t hesitate to consult with healthcare professionals. It’s all about ensuring a healthy and safe pregnancy!
id: Tekanan darah adalah kekuatan yang dihasilkan darah saat mengalir melalui pembuluh darah dari jantung ke seluruh tubuh. Angka normalnya biasanya sekitar 120/80 mmHg, tetapi bisa berubah tergantung berbagai faktor seperti aktivitas fisik, makanan, dan stres. Selama kehamilan, penting banget untuk memantau tekanan darah, karena tekanan darah tinggi atau hipertensi bisa berisiko bagi ibu dan bayi. Hipertensi bisa muncul dalam beberapa bentuk, seperti hipertensi kronis yang sudah ada sebelum kehamilan, atau hipertensi gestasional yang muncul setelah minggu ke-20. Ada juga preeklamsia, yang ditandai dengan lonjakan tekanan darah yang disertai gejala lain, dan ini bisa sangat berbahaya. Jika tidak ditangani, hipertensi dapat mengurangi aliran darah ke plasenta, sehingga janin tidak mendapatkan cukup oksigen dan nutrisi, yang bisa menyebabkan masalah pertumbuhan atau kelahiran prematur. Selain itu, hipertensi juga meningkatkan risiko komplikasi seperti solusio plasenta, yang merupakan pemisahan plasenta dari dinding rahim, dan ini bisa menyebabkan pendarahan serius. Memantau tekanan darah secara rutin membantu kamu dan dokter untuk mendeteksi masalah lebih awal, sehingga bisa diambil langkah yang tepat demi kesehatan ibu dan bayi. Dengan memahami pentingnya pencatatan tekanan darah, kamu bisa lebih proaktif dalam menjaga kesehatan selama masa kehamilan. Jika ada tanda-tanda yang mencurigakan, jangan ragu untuk berkonsultasi dengan tenaga medis. Ini semua demi memastikan kehamilan yang sehat dan aman!

# babyKicksInfo
source: Why Is Monitoring Fetal Movement Important?
id: Mengapa Memantau Gerakan Janin Itu Penting?
